# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

n = int(input("введите число "))
m = n % 10
print(m)
l = n//10 % 10
print(l)
v = n//100 % 10
print(v)
print("Сумма цифр в числе", n, "=", m + l + v)
